-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               8.0.32 - MySQL Community Server - GPL
-- Server OS:                    Win64
-- HeidiSQL Version:             12.5.0.6677
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- Dumping structure for table database.chars
CREATE TABLE IF NOT EXISTS `chars` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(80) COLLATE utf8mb4_unicode_ci NOT NULL,
  `path` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `faction` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `rarity` int NOT NULL,
  `source` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `hp1` int NOT NULL,
  `hp80` int NOT NULL,
  `def1` int NOT NULL,
  `def80` int NOT NULL,
  `atk1` int NOT NULL,
  `atk80` int NOT NULL,
  `spd1` int NOT NULL,
  `recomendconus` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table database.chars: ~28 rows (approximately)
INSERT INTO `chars` (`id`, `name`, `path`, `type`, `faction`, `rarity`, `source`, `hp1`, `hp80`, `def1`, `def80`, `atk1`, `atk80`, `spd1`, `recomendconus`) VALUES
	(1, 'Первопроходец (Разрушение)', 'разрушение', 'физический', 'Звездный экспресс', 5, 'сюжет', 163, 1203, 62, 460, 84, 620, 100, NULL),
	(2, 'Март 7', 'сохранение', 'ледяной', 'Звездный экспресс', 4, 'сюжет', 144, 1058, 78, 573, 69, 511, 101, NULL),
	(3, 'Хук', 'разрушение', 'огненный', 'Белобог', 4, 'прыжок', 182, 1340, 48, 352, 84, 617, 94, NULL),
	(4, 'Клара', 'разрушение', 'физический', 'Белобог', 5, 'прыжок', 179, 1319, 66, 485, 100, 737, 90, NULL),
	(5, 'Арлан', 'разрушение', 'электрический', 'Космическая станция "Герта"', 4, 'прыжок', 163, 1199, 45, 330, 81, 599, 102, NULL),
	(6, 'Яньцин', 'охота', 'ледяной', 'Лофу Сяньчжоу', 5, 'прыжок', 121, 892, 56, 412, 92, 679, 109, NULL),
	(7, 'Сушан', 'охота', 'физический', 'Лофу Сяньчжоу', 4, 'прыжок', 124, 917, 57, 418, 76, 564, 107, NULL),
	(8, 'Зеле', 'охота', 'квантовый', 'Белобог', 5, 'ограниченный прыжок', 126, 931, 49, 363, 87, 640, 115, NULL),
	(9, 'Дань Хэн', 'охота', 'ветряной', 'Звездный экспресс', 4, 'сюжет', 120, 882, 54, 396, 74, 546, 110, NULL),
	(10, 'Цзин Юань', 'эрудиция', 'электрический', 'Лофу Сяньчжоу', 5, 'ограниченный прыжок', 158, 1164, 66, 485, 95, 698, 99, NULL),
	(11, 'Цинцюэ', 'эрудиция', 'квантовый', 'Лофу Сяньчжоу', 4, 'прыжок', 139, 1023, 60, 441, 88, 652, 98, NULL),
	(12, 'Сервал', 'эрудиция', 'электрический', 'Белобог', 4, 'сюжет', 124, 917, 51, 374, 88, 652, 104, NULL),
	(13, 'Герта', 'эрудиция', 'ледяной', 'Космическая станция "Герта"', 4, 'Виртуальная вселенная', 129, 952, 54, 396, 79, 582, 100, NULL),
	(14, 'Химеко', 'эрудиция', 'огненный', 'Звездный экспресс', 5, 'прыжок', 142, 1047, 59, 436, 102, 756, 96, NULL),
	(15, 'Аста', 'гармония', 'огненный', 'Космическая сатнция "Герта"', 4, 'сюжет', 139, 1023, 63, 463, 69, 511, 106, NULL),
	(16, 'Броня', 'гармония', 'ветряной', 'Белобог', 5, 'стандартный прыжок', 168, 1241, 72, 533, 79, 582, 99, NULL),
	(17, 'Тинъюнь', 'гармония', 'электрический', 'Лофу Сяньчжоу', 4, 'прыжок', 115, 846, 54, 396, 72, 529, 112, NULL),
	(18, 'Юйкун', 'гармония', 'мнимый', 'Лофу Сяньчжоу', 4, 'прыжок', 0, 0, 0, 0, 0, 0, 0, NULL),
	(19, 'Серебрянный волк', 'небытие', 'квантовый', 'Охотники за Стеллароном', 5, 'ограниченный прыжок', 190, 1047, 83, 460, 113, 640, 107, NULL),
	(20, 'Сампо', 'небытие', 'ветрянной', 'Белобог', 4, 'прыжок', 139, 1023, 54, 396, 84, 617, 102, NULL),
	(21, 'Пела', 'небытие', 'ледяной', 'Белобог', 4, 'прыжок', 134, 987, 63, 463, 74, 546, 105, NULL),
	(22, 'Вельт', 'небытие', 'мнимый', 'Звездный экспресс', 5, 'прыжок', 153, 1125, 69, 509, 84, 620, 102, NULL),
	(23, 'Гепард', 'сохранение', 'ледяной', 'Белобог', 5, 'прыжок', 190, 1397, 89, 654, 73, 543, 92, NULL),
	(24, 'Первопроходец (Созранение)', 'сохранение', 'огненный', 'Звездный экспресс', 5, 'сюжет', 168, 1241, 82, 606, 81, 601, 95, NULL),
	(25, 'Фу Сюань', 'сохранение', 'квантовый', 'Лофу Сяньчжоу', 5, 'ограниченный прыжок', 0, 0, 0, 0, 0, 0, 0, NULL),
	(26, 'Наташа', 'изобилие', 'физический', 'Белобог', 4, 'сюжет', 158, 1164, 69, 507, 64, 476, 98, NULL),
	(27, 'Байлу', 'изобилие', 'электрический', 'Лофу Сяньчжоу', 5, 'прыжок', 200, 1319, 66, 485, 76, 562, 98, NULL),
	(28, 'Лоча', 'изобилие', 'мнимый', 'Лофу Сяньчжоу', 5, 'ограниченный прыжок', 0, 0, 0, 0, 0, 0, 0, NULL);

-- Dumping structure for table database.cones
CREATE TABLE IF NOT EXISTS `cones` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `path` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `rarity` int NOT NULL,
  `source` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `hp1` int NOT NULL,
  `hp80` int NOT NULL,
  `def1` int NOT NULL,
  `def80` int NOT NULL,
  `atk1` int NOT NULL,
  `atk80` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=58 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table database.cones: ~57 rows (approximately)
INSERT INTO `cones` (`id`, `name`, `path`, `rarity`, `source`, `hp1`, `hp80`, `def1`, `def80`, `atk1`, `atk80`) VALUES
	(1, 'Ключ от всех дверей', 'эрудиция', 3, 'неизвестно', 33, 740, 12, 264, 16, 370),
	(2, 'Сцепленные шестерни', 'гармония', 3, 'прыжок', 38, 846, 12, 264, 14, 317),
	(3, 'Петля', 'небытие', 3, 'неизвестно', 38, 846, 12, 264, 14, 317),
	(4, 'Оборона', 'сохранение', 3, 'прыжок', 43, 952, 12, 264, 12, 264),
	(5, 'Расколовшийся дом', 'разрушение', 3, 'неизвестно', 38, 846, 9, 198, 16, 370),
	(6, 'Спелый плод', 'изобилие', 3, 'прыжок', 43, 952, 9, 198, 14, 317),
	(7, 'Выпущенная стрела', 'охота', 3, 'неизвестно', 33, 740, 12, 264, 16, 370),
	(8, 'База данных', 'эрудиция', 3, 'прыжок', 33, 740, 12, 264, 16, 370),
	(9, 'Хор', 'гармония', 3, 'неизвестно', 38, 846, 12, 264, 14, 317),
	(10, 'Пустота', 'небытие', 3, 'неизвестно', 38, 846, 12, 264, 14, 317),
	(11, 'Янтарь', 'сохранение', 3, 'неизвестно', 38, 846, 15, 330, 12, 264),
	(12, 'Падение небес', 'разрушение', 3, 'прыжок', 38, 846, 9, 198, 16, 370),
	(13, 'Рог изобилия', 'изобилие', 3, 'неизвестно', 43, 952, 12, 264, 12, 264),
	(14, 'Стрелы', 'охота', 3, 'неизвестно', 38, 846, 12, 264, 14, 317),
	(15, 'Бежать некуда', 'разрушение', 4, 'неизвестно', 43, 952, 12, 264, 24, 529),
	(16, 'Гав! Время прогулок!', 'разрушение', 4, 'неизвестно', 43, 952, 15, 330, 21, 476),
	(17, 'Тайная клятва', 'разрушение', 4, 'неизвестно', 48, 1058, 12, 264, 21, 476),
	(18, 'Кроты приветсвуют тебя', 'разрушение', 4, 'неизвестно', 48, 1058, 12, 264, 21, 476),
	(19, 'Больше подписок', 'охота', 4, 'прыжок', 43, 952, 15, 330, 21, 476),
	(20, 'Назад во тьму', 'охота', 4, 'неизвестно', 38, 846, 15, 330, 24, 529),
	(21, 'Фехтование', 'охота', 4, 'неизвестно', 43, 952, 15, 330, 21, 476),
	(22, 'Остается лишь тишина', 'охота', 4, 'прыжок', 43, 952, 15, 330, 21, 476),
	(23, 'Отдых гениев', 'эрудиция', 4, 'прыжок', 38, 846, 18, 396, 21, 476),
	(24, 'Сегодня тоже мирный день', 'эрудиция', 4, 'честь безымянных', 38, 846, 15, 330, 24, 529),
	(25, 'Важность завтрака', 'эрудиция', 4, 'неизвестно', 38, 846, 18, 396, 21, 476),
	(26, 'Пусть мир не стихает', 'эрудиция', 4, 'прыжок', 38, 846, 18, 396, 21, 476),
	(27, 'Зарождение себя', 'эрудиция', 4, 'неизвестно', 43, 952, 15, 330, 21, 476),
	(28, 'Прошлое и будущее', 'гармония', 4, 'магазин', 43, 952, 18, 396, 19, 423),
	(29, 'Вырезать луну и кроить облака', 'гармония', 4, 'честь безымянных', 43, 952, 15, 330, 21, 476),
	(30, 'Воспоминания о прошлом', 'гармония', 4, 'неизвестно', 43, 952, 18, 396, 19, 423),
	(31, 'Свидание со звездами', 'гармония', 4, 'неизвестно', 48, 1058, 15, 330, 19, 423),
	(32, 'Спокойной ночи и мирного сна', 'небытие', 4, 'прыжок', 43, 952, 15, 330, 21, 476),
	(33, 'Взгляд жертвы', 'небытие', 4, 'прыжок', 43, 952, 15, 330, 21, 476),
	(34, 'Мы еще встретимся', 'небытие', 4, 'честь безымянных', 38, 846, 15, 330, 24, 529),
	(35, 'Фермата', 'небытие', 4, 'магазин', 43, 952, 15, 330, 21, 476),
	(36, 'Перед началом тренировочной миссии', 'небытие', 4, 'неизвестно', 43, 953, 15, 330, 21, 476),
	(37, 'Первый день моей новой жизни', 'сохранение', 4, 'неизвестно', 43, 952, 21, 463, 16, 370),
	(38, 'Выбор Ландау', 'сохранение', 4, 'неизвестно', 43, 952, 18, 396, 19, 423),
	(39, 'Это я!', 'сохранение', 4, 'неизвестно', 38, 846, 24, 529, 16, 370),
	(40, 'Тренд галактического рынка', 'сохранение', 4, 'прыжок', 48, 1058, 18, 396, 16, 370),
	(41, 'Мы - Дикий Огонь', 'сохранение', 4, 'магазин', 33, 740, 21, 463, 21, 476),
	(42, 'Беседа после операции', 'изобилие', 4, 'неизвестно', 48, 1058, 15, 330, 19, 423),
	(43, 'Общие чуства', 'изобилие', 4, 'неизвестно', 48, 1058, 18, 396, 16, 370),
	(44, 'Холодные ночи короче, когда ты рядом', 'изобилие', 4, 'Честь Безымянных', 48, 1058, 18, 396, 16, 370),
	(45, 'Что-то незаминимое', 'разрушение', 5, 'неизвестно', 52, 1164, 15, 330, 28, 635),
	(46, 'О падении Эона', 'разрушение', 5, 'магазин Герты (Виртуальная вселенная)', 52, 1164, 18, 396, 26, 582),
	(47, 'В ночи', 'охота', 5, 'ограниченный прыжок', 48, 1058, 21, 463, 26, 582),
	(48, 'Мертвецкий сон', 'охота', 5, 'стандартный прыжок', 48, 1058, 21, 463, 26, 582),
	(49, 'Круиз по галактике', 'охота', 5, 'магазин Герты (Виртуальная вселенная)', 48, 1058, 21, 463, 26, 582),
	(50, 'Ночь на Млечном пути', 'эрудиция', 5, 'стандартный прыжок', 52, 1164, 18, 396, 26, 582),
	(51, 'До заката', 'эрудиция', 5, 'ограниченный прыжок', 48, 1058, 18, 396, 28, 635),
	(52, 'Битва не окончена', 'гармония', 5, 'стандартный прыжок', 52, 1164, 21, 463, 24, 529),
	(53, 'Во имя мира', 'небытие', 5, 'стандартный прыжок', 48, 1058, 21, 463, 26, 582),
	(54, 'Непрекращающийся дождь', 'небытие', 5, 'ограниченный прыжок', 48, 1058, 21, 463, 26, 582),
	(55, 'Время никого не ждет', 'изобилие', 5, 'стандартный прыжок', 57, 1270, 21, 463, 21, 576),
	(56, 'Момент победы', 'сохранение', 5, 'стандартный прыжок', 48, 1058, 27, 595, 21, 476),
	(57, 'Материя памяти', 'сохранение', 5, 'магазин Герты (Виртуальная вселенная)', 48, 1058, 24, 529, 24, 529);

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
